



<HTML>
<head>
<title>Article sur la St&eacute;ganographie</title>
<meta name="Description" content="David Glaude's first page about Stéganographie.">
<meta name="Keywords" content="Steganography, David, Glaude, Belgium.">
<meta name="Author" content="David Glaude">
<meta name="Date" content="April 13, 1998">
<meta name="GENERATOR" content="Linux, vi, Konqueror, Htp-patched-for-png.">
</head>
<body background="design/artstegf.png">
<table cellspacing=0>
<tr>
<td align=center valign=middle width=80>
<a href="index.htm"><img src="design/indexj.png" ZZZ="design/defaultj.png" align=bottom WIDTH="75" HEIGHT="75"></a>
</td>
<td width=25></td>
<td align=center valign=middle>
<A HREF="ci.htm"><img src="design/cii.png" ZZZ="design/defaulti.png" align=center WIDTH="50" HEIGHT="50"></a>&nbsp;
<A HREF="electro.htm"><img src="design/electroi.png" ZZZ="design/defaulti.png" align=center WIDTH="50" HEIGHT="50"></a>&nbsp;
<A HREF="games.htm"><img src="design/gamesi.png" ZZZ="design/defaulti.png" align=center WIDTH="50" HEIGHT="50"></a>&nbsp;
<A HREF="stegano.htm"><img src="design/steganoj.png" ZZZ="design/defaultj.png" align=center WIDTH="75" HEIGHT="75"></a>&nbsp;
<A HREF="telorga.htm"><img src="design/telorgaj.png" ZZZ="design/defaultj.png" align=center WIDTH="75" HEIGHT="75"></a>&nbsp;
<A HREF="various.htm"><img src="design/variousi.png" ZZZ="design/defaulti.png" align=center WIDTH="50" HEIGHT="50"></a>&nbsp;
<A HREF="valerie.htm"><img ZZZ="design/valeriei.png" SRC="design/defaulti.png" align=center WIDTH="50" HEIGHT="50"></a>&nbsp;
<A HREF="zillion.htm"><img src="design/zillioni.png" ZZZ="design/defaulti.png" align=center WIDTH="50" HEIGHT="50"></a>&nbsp;
<A HREF="wip.htm"><img ZZZ="design/wipi.png" SRC="design/defaulti.png" align=center WIDTH="50" HEIGHT="50"></a>&nbsp;
</td>
</tr>
<tr>
<td align=center valign=middle width=80><img ZZZ="design/artstegs.png" SRC="design/defaults.png" alt="-" WIDTH="80" HEIGHT="12">
</td>
<td><img src="design/img151.png" alt="." align=center WIDTH="15" HEIGHT="1">
</td>
<td align=center valign=middle><img ZZZ="design/artstegl.png" SRC="design/defaultl.png" alt="---" WIDTH="450" HEIGHT="12">
</td>
</tr>
<tr>
<td align=center valign=top width=80>
<A HREF="artsteg.htm"><img src="design/artstegj.png" ZZZ="design/defaultj.png" align=bottom WIDTH="75" HEIGHT="75"></a><br>
<A HREF="png.htm"><img src="design/pngi.png" ZZZ="design/defaulti.png" align=bottom WIDTH="50" HEIGHT="50"></a><br>
<A HREF="sgpo.htm"><img src="design/sgpoi.png" ZZZ="design/defaulti.png" align=bottom WIDTH="50" HEIGHT="50"></a><br>
<A HREF="projci.htm"><img src="design/projcii.png" ZZZ="design/defaulti.png" align=bottom WIDTH="50" HEIGHT="50"></a><br>
</td>
<td></td>
<td valign=top>
<!-- Start of the Body -->
<H1>St&eacute;ganographie (‘steganography’)</H1>

<H2>Qu'est-ce que la St&eacute;ganographie ?</H2>

<P>Le mot st&eacute;ganographie vient du grec ‘steganos’ (cach&eacute; ou secret) et ‘graphy’ (&eacute;criture ou dessin) et signifie, litt&eacute;ralement, ‘&eacute;criture cach&eacute;e’.</P>
<P>La st&eacute;ganographie &eacute;tudie les techniques pour communiquer de l'information de fa&ccedil;on cach&eacute;e. L’adjectif cach&eacute; ne signifie pas ici que l’information est visible mais cod&eacute;e, il s’agit alors de cryptographie. Ici, il signifie que la pr&eacute;sence de l’information n’est pas perceptible parce que enfouie dans une autre information.</P>
<P>Nous voil&agrave; plong&eacute; en plein roman d'espionnage. Vous l’aurez compris, la st&eacute;ganographie dont je veux vous parler ne s'int&eacute;resse pas vraiment aux micro-films et autres valises &agrave; double fond, mais &agrave; une version plus moderne d’outils de ce genre.</P>
<P>Pour r&eacute;sumer le probl&egrave;me de fa&ccedil;ons plus acad&eacute;mique, utilisons une pr&eacute;sentation proche de celle utilis&eacute;e en cryptographie. Alice et Bob ont &eacute;t&eacute; arr&ecirc;t&eacute;s et emprisonn&eacute;s. Ils d&eacute;sirent se communiquer des informations afin d'organiser leur d&eacute;fense lors du proc&egrave;s (ou leur &eacute;vasion). Ils sont autoris&eacute;s &agrave; communiquer quasi librement avec la restriction que tous les messages seront lus par les responsables de la prison. Ils utiliseront la st&eacute;ganographie pour communiquer leur plan.</P>
<P>Pour pouvoir communiquer de fa&ccedil;on secr&egrave;te, il faut d'abord pouvoir communiquer tout simplement. On attachera &agrave; des messages anodins, un message secret. Afin de d&eacute;coder ce message, le correspondant doit conna&icirc;tre un secret et/ou la technique pour d&eacute;chiffrer et extraire ce message. Il est &eacute;vident que ce message cach&eacute; peut &ecirc;tre lui m&ecirc;me cod&eacute; et/ou sign&eacute; en utilisant des m&eacute;thodes cryptographiques. La st&eacute;ganographie n’&eacute;tant plus alors que la derni&egrave;re &eacute;tape de votre encodage, celle-ci pouvant m&ecirc;me &ecirc;tre destin&eacute;e &agrave; cacher votre usage de la cryptographie.</P>

<H2>A quoi peut servir la St&eacute;ganographie ?</H2>

<P>La St&eacute;ganographie n'est pas qu'un gadget pour agent secret ou un amusement pour les chercheurs en cryptographie. De nombreux usages peuvent exister dans des domaines tr&egrave;s vari&eacute;s mais souvent sensibles.</P>

<UL>
<LI>Communiquer en toute libert&eacute; m&ecirc;me dans des conditions de censure et de surveillance.</LI>
<LI>Prot&eacute;ger ses communications priv&eacute;es l&agrave; o&ugrave; l’utilisation de la crytographie n’est normalement pas permise ou soul&egrave;verait des suspicions.</LI>
<LI>Contrebalancer toutes les l&eacute;gislations ou barri&egrave;res possibles emp&ecirc;chant l’usage de la cryptographie.</LI>
<LI>Publier des informations ouvertement mais &agrave; l’insu de tous des informations qui pourront ensuite &ecirc;tre r&eacute;v&eacute;l&eacute;es et dont l’ant&eacute;riorit&eacute; sera incontestable et v&eacute;rifiable par tous.</LI>
</UL>

<P>Il existe aussi aux moins deux classes de techniques faisant partie de la st&eacute;ganographie mais suffisamment particuli&egrave;re pour m&eacute;riter un nom.</P>

<H3>Filigrane (‘watermarking’)&nbsp;:</H3>

<UL>
<LI>Prot&eacute;ger les possesseurs de copyright sur des documents num&eacute;riques en cachant une signature dans l'information de sorte que m&ecirc;me une partie modifi&eacute;e du document conserve la signature.</LI>
<LI>D&eacute;couvrir l’origine de fuites en marquant de fa&ccedil;on cach&eacute;e et unique chaque copie d’un document confidentiel.</LI>
</UL>

<H3>Canal de communication secr&egrave;te (‘cover channel’)&nbsp;:</H3>

<UL>
<LI>Permettre &agrave; des partenaires de communiquer de fa&ccedil;on secr&egrave;te en &eacute;tablissant un v&eacute;ritable protocole de communication secr&egrave;te au dessus d’autres protocoles anodins.</LI>
<LI>Permettre une communication non autoris&eacute; &agrave; travers les communications autoris&eacute; d’un firewall.</LI>
</UL>

<P>Ces techniques peuvent &ecirc;tre utilis&eacute;es par les agents secret, les mafias et les extra-terrestres qui tous veulent rester bien cach&eacute;s. Naturellement, l’honn&ecirc;te homme a tout autant de raisons d’utiliser ces techniques.</P>
<P>Un argument utilis&eacute; par les &eacute;tats pour interdire la cryptographie est de dire que les citoyens honn&ecirc;tes n’ont rien &agrave; cacher et de soup&ccedil;onner tous ceux qui utiliseraient de telles techniques. Cette logique appliqu&eacute;e au courrier interdirait l’usage des enveloppes et n’autoriserait que les cartes postales. La st&eacute;ganographie vous permettra de cacher votre vrai message dans la photo accompagn&eacute;e d’un message anodin &agrave; c&ocirc;t&eacute; de l’adresse.</P>

<H2>O&ugrave; et comment cacher l’information secr&egrave;te ?</H2>

<P>Selon la forme sous laquelle l’information non secr&egrave;te est transmise, diff&eacute;rentes voies sont possibles pour cacher de l’information.</P>

<H3>Texte</H3>

<P>Le placement des ponctuations, l’introduction de variations orthographiques ou typographiques, le choix entre des synonymes ou des formes grammaticales, l’espacement entre les mots sont des fa&ccedil;ons simples d’ajouter de l’information sans perturber l’information originale.</P>
<P>D’autres techniques plus subtiles mais aussi plus d&eacute;licates &agrave; mettre en œuvre, consistent &agrave; offrir d’autres clefs de lecture en utilisant que certaines lettres ou les lettres dans un certain ordre.</P>
<P>On peut aussi utiliser un g&eacute;n&eacute;rateur de texte ‘al&eacute;atoire’ bas&eacute; sur une sorte de ‘grammaire’. Les choix faits pour la g&eacute;n&eacute;ration du texte correspondent au message secret.</P>

<H3>Son</H3>

<P>De faibles variations, imperceptible pour l’oreille, dans les basses fr&eacute;quences ou ce que l’on appelle le bruit de fond peuvent contenir une grande quantit&eacute; d’information. Un gr&eacute;sillement infime peut cacher des secrets. Evidemment, ce bruit doit de pr&eacute;f&eacute;rence &ecirc;tre transmis de fa&ccedil;on num&eacute;rique sans quoi les vrais pertes de transmission pourraient effacer enti&egrave;rement le message cach&eacute;.</P>
<P>Afin de rester ind&eacute;celable, le bruit artificiel doit poss&eacute;der les propri&eacute;t&eacute;s statistiques d’un vrai bruit de fond.</P>

<H3>Image</H3>

<P>De la m&ecirc;me mani&egrave;re que pour le son, des variations dans les basses fr&eacute;quences de l’image peuvent contenir de l’information. Lorsque le transfert d’information est num&eacute;rique, d’autres d&eacute;tails du codage de l’image, telle la palette de couleur, peuvent &eacute;galement contenir des informations. Pour le ‘watermarking’ on pr&eacute;f&eacute;rera reproduire plusieurs fois la signature dans les zones les plus contrast&eacute;es pour que celle-ci r&eacute;siste le plus possible &agrave; des modifications de l’image.</P>

<H3>Autres</H3>

<P>Naturellement, il existe autant d’endroits o&ugrave; cacher de l’information qu’il existe de formats et de types de donn&eacute;es, les plus fr&eacute;quemment utilis&eacute;s &eacute;tant les plus anodins. On peut penser facilement aux formats multim&eacute;dia, mais aussi aux formats de compression, d’archive et d’encodage. M&ecirc;me une simple page HTML peut contenir plus que ce vous pouvez y voir &agrave; travers votre outil de navigation.</P>

<H2>Peut-on d&eacute;tecter ou emp&ecirc;cher l’usage de la st&eacute;ganographie&nbsp;?</H2>

<P>L’observateur qui soup&ccedil;onne une communication cach&eacute; et celui qui veut l’emp&ecirc;cher ne sont ni l’un ni l’autre d&eacute;muni de possibilit&eacute;s, m&ecirc;me s’il est dur de lutter contre une technique inconnue.</P>
<P>L’observateur peut comparer les propri&eacute;t&eacute;s statistiques de la communication qu’il soup&ccedil;onne et les comparer avec celles d’une communication ne contenant pas de messages cach&eacute;s. De trop grandes diff&eacute;rences peuvent &ecirc;tre l’indice d’une communication cach&eacute;e ou n’&ecirc;tre qu’une simple anomalie statistique. Une fois d&eacute;couvert, on peut essayer de retrouver le message cach&eacute; en utilisant des techniques de cryptanalyse, c’est-&agrave;-dire les techniques pour casser des codes cryptographiques.</P>
<P>Pour interdire toute communication cach&eacute;e il faut pouvoir intercepter et transformer ou interdire toutes les communications (car elle peuvent potentiellement servir de transport). Un firewall poss&egrave;de les propri&eacute;t&eacute;s appropri&eacute;es pour ce genre de contr&ocirc;le absolu des communications. Celui qui veut emp&ecirc;cher une communication cach&eacute;e se doit n&eacute;anmoins de laisser passer le message clair tout en d&eacute;truisant le message cach&eacute;. Il peut aussi tout simplement d&eacute;truire tout message suspect (voir tout message). Sinon, il est oblig&eacute; de modifier le message tout en lui conservant son sens ou aspect original.</P>
<P>Puisque le bruit de fond ou les basses fr&eacute;quences sont des bonnes cachettes, il faudra y rajouter son propre bruit, ou filtrer le bruit existant. Il s’agit donc d’une sorte de d&eacute;gradation du message. On pourra aussi d&eacute;coder/d&eacute;compresser puis coder/compresser le message pour le d&eacute;barrasser des cachettes utilisant les particularit&eacute;s de certain codage.</P>
<P>Bref, un lutte efficace contre la st&eacute;ganographie est difficile &agrave; mettre en œuvre m&ecirc;me s’il existe des pistes int&eacute;ressantes.</P>

<H2>La st&eacute;ganographie, un sujet d’actualit&eacute;</H2>

<P>On parle beaucoup de libert&eacute; d’expression et de la r&eacute;pression de l’usage de la cryptographie sur l’internet. Des outils int&eacute;grant des techniques st&eacute;ganographiques auront sans nul doute leurs heures de gloire sur l’internet, tout comme PGP &agrave; rendu la cryptographie accessible &agrave; tous.</P>
<P>Un autre sujet ‘&agrave; la mode’ sur l’internet concerne ‘the bible code’ o&ugrave; le code cach&eacute; de la bible. Une &eacute;tude statistique du texte h&eacute;breux de la bible d&eacute;montre qu’il y a de fortes chances pour que des informations soient cach&eacute;es dans la bible. Celles-ci seraient &eacute;crites en ne tenant compte que de lettres espac&eacute;es d’une distance &eacute;gale. Si message il y a, il s’agit alors d’une forme de st&eacute;ganographie.</P>
<P>Dans le cas des ‘codes de la bible’, les informations cach&eacute;es font r&eacute;f&eacute;rences au futur, par rapport au temps de l’&eacute;criture de la bible. Ces informations ainsi que la puissance de calcul n&eacute;cessaire &agrave; ce codage n’&eacute;taient pas accessible aux hommes de l’&eacute;poque. Peut-on d&egrave;s lors se demander qui peut bien avoir &eacute;crit ce best-seller.</P>
<P>Des personnes ambitieuses ont essay&eacute; de pr&eacute;dire l’avenir en lisant la bible non pas entre les lignes comme c’est souvent le cas mais bien dans le texte, en sautant un nombre constant de caract&egrave;res &agrave; chaque fois. Ceci n’est pas tr&egrave;s scientifique mais est des plus m&eacute;diatique.</P>

<H2>Conclusions</H2>

<P>La st&eacute;ganographie est un sujet encore peu &eacute;tudi&eacute; et faiblement m&eacute;diatis&eacute; en tant que tel mais qui va certainement conna&icirc;tre ses heures de gloire dans un futur proche. Les liens entre la st&eacute;ganographie et la t&eacute;l&eacute;matique sont &eacute;vidents et son usage sur l’internet semble promis &agrave; un bel avenir.</P>
<P>Les diff&eacute;rentes facettes du sujet vous permettront certainement d’aborder le sujet dans une conversation mondaine. Nul doute que le fait de placer le terme ‘st&eacute;ganographie’ dans une conversation attirera vers vous admiration, int&eacute;r&ecirc;t et &eacute;tonnement.</P>
<P>Si cet article vous &agrave; plu et que le sujet vous int&eacute;resse, n’h&eacute;sitez pas &agrave; lancer votre fid&egrave;le outil de recherche sur la piste des termes ‘steganography’ ou ‘bible’ et ‘code’.</P>

<P ALIGN="RIGHT">David GLAUDE</P>

<HR>

<H2>Mise &agrave; jour</H2>

<P>Cet article a eu beaucoup de succ&egrave;s car il semble une bonne introduction au sujet pour les francophones. Je suppose aussi quelques site font r&eacute;f&eacute;rence &agrave; ma page.</P>

<P>Je suis d&eacute;sol&eacute; de ne pouvoir aider les &eacute;tudiant et chercheur qui m'ont contact&eacute;, mais je ne suis vraiment pas un sp&eacute;cialiste du sujet.</P>

<P>Apr&egrave;s les &eacute;venements du 11 septembre 2001, de nombreux journaux ont suggerer que la st&eacute;ganographie &agrave; &eacute;t&eacute; utilis&eacute;e. Ceci n'a jamais &eacute;t&eacute; d&eacute;montr&eacute; (comme beaucoup d'autres affirmations) et ressemble &agrave; une tentative d'interdire l'utilisation de la st&eacute;ganographie. Il faut craindre pour nos libert&eacute;es.</P>

<P>Microsoft semble &eacute;galement avoir un int&eacute;ret soudain pour la st&eacute;ganographie en sponsorisant de conf&eacute;rence sur le sujet. Cela m'inqui&egrave;te fortement. Je suppose qu'ils sont interess&eacute;s par l'utilisation du watermarking pour la protection du copyright sur les chansons et vid&eacute;o en ligne. Si Microsoft arrive &agrave; imposer un syst&egrave;me via mediaplayer et en profitant de leurs monopoles actuel, il risque d'augmenter leurs monopoles et restreindre encore plus nos libertées.</P>

<P>Le watermarking est le côt&eacute; obscure de la st&eacute;ganographie. Il permet de tracer, de suivre la propagation des documents et des informations. Pour rester libre et &eacute;viter des espions dans votre ordinateur, puis-je vous conseiller le logiciel libre et les standards ouvert?</P>

<!-- End of the Body -->
</td>
</tr>
<tr>
<td align=center valign=middle width=80><img ZZZ="design/artstegs.png" SRC="design/defaults.png" alt="-" WIDTH="80" HEIGHT="12">
</td>
<td><img src="design/img151.png" alt="." align=center WIDTH="15" HEIGHT="1">
</td>
<td align=center valign=middle><img ZZZ="design/artstegl.png" SRC="design/defaultl.png" alt="---" WIDTH="450" HEIGHT="12">
</td>
</tr>
<tr>
<td align=center valign=middle width=80>no counter</td>
<td></td>
<td align=center valign=middle>
The content of this page is copyrighted: &copy;David GLAUDE.<br>
Content last updated: Fri Apr 26, 2002.<br>
This file generated: Fri Apr 26 12:17:32 CEST 2002
.<br>
</td>
</tr>
</TABLE>
<!-- http://users.skynet.be/glu/artsteg.htm -->
